#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.lambda_layers.data.archive_file.layer_archive["utility_zip_file"]: Reading...
module.lambda_layers.data.archive_file.layer_archive["utility_zip_file"]: Read complete after 0s [id=1f54fcb211ef2502758c012188bb9cd8d499b374]
module.lambda_layers.module.lambda_layer["utility_zip_file"].data.aws_caller_identity.current: Reading...
module.lambda_layers.module.lambda_layer["utility_zip_file"].data.aws_partition.current: Reading...
module.dashboard.data.aws_region.current: Reading...
data.aws_route53_zone.domain_zone: Reading...
module.lambda_layers.module.lambda_layer["utility_zip_file"].data.aws_region.current: Reading...
module.acm_certificate.aws_acm_certificate.app: Refreshing state... [id=arn:aws:acm:us-east-1:836049003243:certificate/e5cdfc4e-8321-41d9-968d-813fd8306a21]
module.sns.aws_sns_topic.email_topic: Refreshing state... [id=arn:aws:sns:us-east-1:836049003243:mulla-website-prod-email]
module.s3_bucket.aws_s3_bucket.website: Refreshing state... [id=mulla-website-prod]
module.lambda_layers.module.lambda_layer["utility_zip_file"].data.aws_partition.current: Read complete after 0s [id=aws]
module.lambda_layers.module.lambda_layer["utility_zip_file"].data.aws_region.current: Read complete after 0s [id=us-east-1]
module.dashboard.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.lambda_layers.module.lambda_layer["utility_zip_file"].data.aws_caller_identity.current: Read complete after 0s [id=836049003243]
module.sns.aws_sns_topic_subscription.send_alert_email["alert@mulla.au"]: Refreshing state... [id=arn:aws:sns:us-east-1:836049003243:mulla-website-prod-email:ce8e18c3-027f-4242-a144-114486ead40e]
module.alarms.module.all_lambdas_errors_alarm.aws_cloudwatch_metric_alarm.this[0]: Refreshing state... [id=mulla-website-prod-all-lambda-errors]
module.cloudfront_waf.aws_wafv2_web_acl.web_acl: Refreshing state... [id=6be686de-e67d-434f-9e74-2c84eb238b6a]
data.aws_route53_zone.domain_zone: Read complete after 1s [id=Z019756110G25DTYU8A62]
module.dns.aws_route53_record.www: Refreshing state... [id=Z019756110G25DTYU8A62_www_CNAME]
module.acm_certificate.aws_route53_record.app["*.mulla.au"]: Refreshing state... [id=Z019756110G25DTYU8A62__59998f89be3aecbef1a8f900beeb9d7d.mulla.au._CNAME]
module.acm_certificate.aws_route53_record.app["mulla.au"]: Refreshing state... [id=Z019756110G25DTYU8A62__59998f89be3aecbef1a8f900beeb9d7d.mulla.au._CNAME]
module.acm_certificate.aws_acm_certificate_validation.app: Refreshing state... [id=2023-11-28 08:10:08.355 +0000 UTC]
module.api.module.api_authorizer.random_password.api_auth_token: Refreshing state... [id=none]
module.api.aws_api_gateway_rest_api.api: Refreshing state... [id=r5j9dfgmj4]
module.api.aws_iam_role.api_role: Refreshing state... [id=mulla-website-prod-api-role]
module.api.module.contact.data.archive_file.lambda_source_package: Reading...
module.api.module.api_authorizer.data.archive_file.lambda_source_package: Reading...
module.api.aws_iam_role.cloudwatch: Refreshing state... [id=mulla-website-prod-api-cloudwatch-role]
module.api.module.contact.data.archive_file.lambda_source_package: Read complete after 0s [id=8138c74d9276518443ade5431aa3b72570054adf]
module.api.module.api_authorizer.data.archive_file.lambda_source_package: Read complete after 0s [id=8c96bd6554b1db5477d56619c3a6fcc9a8941a16]
module.api.module.api_authorizer.aws_ssm_parameter.api_auth_token_ssm: Refreshing state... [id=/mulla-website/prod/api_auth_token]
module.s3_bucket.aws_s3_bucket_public_access_block.website_block: Refreshing state... [id=mulla-website-prod]
module.s3_bucket.aws_s3_bucket_versioning.website_versioning: Refreshing state... [id=mulla-website-prod]
module.s3_bucket.aws_s3_bucket_ownership_controls.website_ownership_controls: Refreshing state... [id=mulla-website-prod]
module.s3_bucket.aws_s3_bucket_cors_configuration.cors: Refreshing state... [id=mulla-website-prod]
module.lambda_layers.aws_s3_object.lambda_code_zip["utility_zip_file"]: Refreshing state... [id=lambda_zip/layer/utility_zip_file]
module.api.module.contact.aws_s3_object.lambda_code_zip: Refreshing state... [id=lambda_zip/function/contact]
module.api.aws_api_gateway_resource.contact: Refreshing state... [id=7lat7t]
module.api.module.api_authorizer.aws_s3_object.lambda_code_zip: Refreshing state... [id=lambda_zip/function/authorizer]
module.api.aws_cloudwatch_log_group.api_gateway_execution_logs: Refreshing state... [id=API-Gateway-Execution-Logs_r5j9dfgmj4/production]
module.s3_bucket.aws_s3_bucket_acl.website_acl: Refreshing state... [id=mulla-website-prod,private]
module.api.aws_iam_role_policy.cloudwatch: Refreshing state... [id=mulla-website-prod-api-cloudwatch-role:mulla-website-prod-cloudwatch-policy]
module.api.aws_api_gateway_account.api_cloudwatch_role: Refreshing state... [id=api-gateway-account]
module.api.module.contact.module.contact_lambda.data.aws_caller_identity.current: Reading...
module.api.module.contact.module.contact_lambda.data.aws_region.current: Reading...
module.api.module.contact.module.contact_lambda.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.api.module.contact.module.contact_lambda.data.aws_partition.current: Reading...
module.api.module.contact.module.contact_lambda.data.aws_partition.current: Read complete after 0s [id=aws]
module.lambda_layers.module.lambda_layer["utility_zip_file"].aws_lambda_layer_version.this[0]: Refreshing state... [id=arn:aws:lambda:us-east-1:836049003243:layer:mulla-website-prod-utility:7]
module.api.module.contact.module.contact_lambda.aws_cloudwatch_log_group.lambda[0]: Refreshing state... [id=/aws/lambda/mulla-website-prod-contact]
module.api.module.contact.module.contact_lambda.data.aws_iam_policy_document.additional_inline[0]: Reading...
module.api.module.contact.module.contact_lambda.data.aws_iam_policy_document.additional_inline[0]: Read complete after 0s [id=2576865068]
module.api.module.contact.module.contact_lambda.data.aws_iam_policy_document.assume_role[0]: Reading...
module.api.module.contact.module.contact_lambda.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.api.module.contact.module.contact_lambda.aws_iam_role.lambda[0]: Refreshing state... [id=mulla-website-prod-contact]
module.api.module.contact.module.contact_lambda.aws_iam_policy.additional_inline[0]: Refreshing state... [id=arn:aws:iam::836049003243:policy/mulla-website-prod-contact-inline]
module.api.module.contact.module.contact_lambda.data.aws_caller_identity.current: Read complete after 0s [id=836049003243]
module.api.module.api_authorizer.module.authorizer_lambda.data.aws_region.current: Reading...
module.api.module.api_authorizer.module.authorizer_lambda.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.api.module.api_authorizer.module.authorizer_lambda.data.aws_caller_identity.current: Reading...
module.api.module.api_authorizer.module.authorizer_lambda.data.aws_partition.current: Reading...
module.api.module.api_authorizer.module.authorizer_lambda.data.aws_partition.current: Read complete after 0s [id=aws]
module.api.module.api_authorizer.module.authorizer_lambda.aws_cloudwatch_log_group.lambda[0]: Refreshing state... [id=/aws/lambda/mulla-website-prod-authorizer]
module.api.module.api_authorizer.module.authorizer_lambda.data.aws_iam_policy_document.assume_role[0]: Reading...
module.api.module.api_authorizer.module.authorizer_lambda.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.api.module.api_authorizer.module.authorizer_lambda.data.aws_iam_policy_document.additional_inline[0]: Reading...
module.api.module.api_authorizer.module.authorizer_lambda.data.aws_iam_policy_document.additional_inline[0]: Read complete after 0s [id=2256909269]
module.api.module.api_authorizer.module.authorizer_lambda.aws_iam_role.lambda[0]: Refreshing state... [id=mulla-website-prod-authorizer]
module.api.module.api_authorizer.module.authorizer_lambda.data.aws_caller_identity.current: Read complete after 0s [id=836049003243]
module.api.module.api_authorizer.module.authorizer_lambda.aws_iam_policy.additional_inline[0]: Refreshing state... [id=arn:aws:iam::836049003243:policy/mulla-website-prod-authorizer-inline]
module.api.module.contact.module.contact_lambda.data.aws_iam_policy_document.logs[0]: Reading...
module.api.module.contact.module.contact_lambda.data.aws_iam_policy_document.logs[0]: Read complete after 0s [id=779959300]
module.api.module.contact.module.contact_lambda.aws_iam_policy.logs[0]: Refreshing state... [id=arn:aws:iam::836049003243:policy/mulla-website-prod-contact-logs]
module.api.module.api_authorizer.module.authorizer_lambda.data.aws_iam_policy_document.logs[0]: Reading...
module.api.module.api_authorizer.module.authorizer_lambda.data.aws_iam_policy_document.logs[0]: Read complete after 0s [id=623675521]
module.api.module.api_authorizer.module.authorizer_lambda.aws_iam_policy.logs[0]: Refreshing state... [id=arn:aws:iam::836049003243:policy/mulla-website-prod-authorizer-logs]
module.api.module.contact.module.contact_lambda.aws_iam_role_policy_attachment.additional_inline[0]: Refreshing state... [id=mulla-website-prod-contact-20231128081033386500000002]
module.api.module.api_authorizer.module.authorizer_lambda.aws_iam_role_policy_attachment.additional_inline[0]: Refreshing state... [id=mulla-website-prod-authorizer-20231128081033526400000003]
module.api.module.api_authorizer.module.authorizer_lambda.aws_iam_role_policy_attachment.logs[0]: Refreshing state... [id=mulla-website-prod-authorizer-20231128081033796900000004]
module.api.module.contact.module.contact_lambda.aws_iam_role_policy_attachment.logs[0]: Refreshing state... [id=mulla-website-prod-contact-20231128081033928600000005]
module.api.module.api_authorizer.module.authorizer_lambda.aws_lambda_function.this[0]: Refreshing state... [id=mulla-website-prod-authorizer]
module.api.module.contact.module.contact_lambda.aws_lambda_function.this[0]: Refreshing state... [id=mulla-website-prod-contact]
module.api.module.contact.aws_lambda_permission.lambda_permession: Refreshing state... [id=AllowAPIGatewayInvoke]
module.api.aws_iam_role_policy.authorizer_invocation_policy: Refreshing state... [id=mulla-website-prod-api-role:mulla-website_prod-authorizer-invocation]
module.api.module.api_authorizer.aws_lambda_permission.lambda_permession: Refreshing state... [id=AllowAPIGatewayInvoke]
module.api.module.api_authorizer.aws_api_gateway_authorizer.lambda_authorizer: Refreshing state... [id=8egyej]
module.api.module.contact.aws_api_gateway_method.contact: Refreshing state... [id=agm-r5j9dfgmj4-7lat7t-POST]
module.api.module.contact.aws_api_gateway_integration.contact_lambda_integration: Refreshing state... [id=agi-r5j9dfgmj4-7lat7t-POST]
module.api.aws_api_gateway_deployment.api_deploy: Refreshing state... [id=8duc9l]
module.api.aws_api_gateway_stage.apigw_stage: Refreshing state... [id=ags-r5j9dfgmj4-prod]
module.api.aws_api_gateway_method_settings.apigw_setting: Refreshing state... [id=r5j9dfgmj4-prod-*/*]
module.cdn.aws_cloudfront_origin_access_control.default: Refreshing state... [id=E3S9YPMCWNG973]
module.cdn.aws_cloudfront_function.remove_path: Refreshing state... [id=mulla-website-prod-remove-path]
module.cdn.aws_cloudfront_origin_request_policy.api_origin_request_policy: Refreshing state... [id=35ab741d-85e0-4bed-ac25-c85736d8f216]
module.cdn.aws_cloudfront_distribution.s3_distribution: Refreshing state... [id=E31O030KNHMSZL]
module.dashboard.aws_cloudwatch_dashboard.monitoring_dashboard: Refreshing state... [id=mulla-website-prod-dashboard]
module.website.data.aws_iam_policy_document.website_policy: Reading...
module.website.data.aws_caller_identity.current: Reading...
module.website.data.aws_iam_policy_document.website_policy: Read complete after 0s [id=1303545816]
module.dns.aws_route53_record.ipv4: Refreshing state... [id=Z019756110G25DTYU8A62_mulla.au_A]
module.website.aws_s3_bucket_server_side_encryption_configuration.s3_encryption: Refreshing state... [id=mulla-website-prod]
module.website.aws_s3_bucket_policy.access: Refreshing state... [id=mulla-website-prod]
module.website.data.aws_caller_identity.current: Read complete after 0s [id=836049003243]
module.website.aws_s3_object.static_files["static/js/main.3be8b4c5.js.LICENSE.txt"]: Refreshing state... [id=website/static/js/main.3be8b4c5.js.LICENSE.txt]
module.website.aws_s3_object.static_files["asset-manifest.json"]: Refreshing state... [id=website/asset-manifest.json]
module.website.aws_s3_object.static_files["index.html"]: Refreshing state... [id=website/index.html]
module.website.aws_s3_object.static_files["static/css/main.b8644671.css.map"]: Refreshing state... [id=website/static/css/main.b8644671.css.map]
module.website.aws_s3_object.static_files["static/css/main.b8644671.css"]: Refreshing state... [id=website/static/css/main.b8644671.css]
module.website.aws_s3_object.static_files["static/js/main.3be8b4c5.js.map"]: Refreshing state... [id=website/static/js/main.3be8b4c5.js.map]
module.website.aws_s3_object.static_files["robots.txt"]: Refreshing state... [id=website/robots.txt]
module.website.aws_s3_object.static_files["sitemap.xml"]: Refreshing state... [id=website/sitemap.xml]
module.website.aws_s3_object.static_files["static/js/496.182f416c.chunk.js.map"]: Refreshing state... [id=website/static/js/496.182f416c.chunk.js.map]
module.website.aws_s3_object.static_files["static/js/496.182f416c.chunk.js"]: Refreshing state... [id=website/static/js/496.182f416c.chunk.js]
module.website.aws_s3_object.static_files["favicon.ico"]: Refreshing state... [id=website/favicon.ico]
module.website.aws_s3_object.static_files["static/js/main.3be8b4c5.js"]: Refreshing state... [id=website/static/js/main.3be8b4c5.js]
module.website.aws_s3_object.images["tishreen-university-logo.webp"]: Refreshing state... [id=images/tishreen-university-logo.webp]
module.website.aws_s3_object.images["portfolio.webp"]: Refreshing state... [id=images/portfolio.webp]
module.website.aws_s3_object.images["iress.webp"]: Refreshing state... [id=images/iress.webp]
module.website.aws_s3_object.images["tarek-mulla.webp"]: Refreshing state... [id=images/tarek-mulla.webp]
module.website.aws_s3_object.images["banner.webp"]: Refreshing state... [id=images/banner.webp]
module.website.aws_s3_object.images["rmit-online-logo.webp"]: Refreshing state... [id=images/rmit-online-logo.webp]
module.website.aws_s3_object.images["cevo-logo.webp"]: Refreshing state... [id=images/cevo-logo.webp]
module.website.aws_s3_object.images["ehealth.webp"]: Refreshing state... [id=images/ehealth.webp]
module.website.aws_s3_object.images["compuleader-logo.webp"]: Refreshing state... [id=images/compuleader-logo.webp]
module.website.aws_s3_object.images["unimelb-logo.webp"]: Refreshing state... [id=images/unimelb-logo.webp]
module.website.aws_s3_object.images["iress-logo.webp"]: Refreshing state... [id=images/iress-logo.webp]
module.website.aws_s3_object.images["cps-234.webp"]: Refreshing state... [id=images/cps-234.webp]
module.website.aws_s3_object.images["ciandt-logo.webp"]: Refreshing state... [id=images/ciandt-logo.webp]
module.website.aws_s3_object.images["tbb.webp"]: Refreshing state... [id=images/tbb.webp]
module.website.aws_s3_object.images["rmit.webp"]: Refreshing state... [id=images/rmit.webp]
module.website.aws_s3_object.images["telstra.webp"]: Refreshing state... [id=images/telstra.webp]
module.website.aws_s3_object.images["rmit-logo.webp"]: Refreshing state... [id=images/rmit-logo.webp]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # module.sns.aws_sns_topic_subscription.send_alert_email["alert@mulla.au"] will be created
  + resource "aws_sns_topic_subscription" "send_alert_email" {
      + arn                             = (known after apply)
      + confirmation_timeout_in_minutes = 1
      + confirmation_was_authenticated  = (known after apply)
      + endpoint                        = "alert@mulla.au"
      + endpoint_auto_confirms          = false
      + filter_policy_scope             = (known after apply)
      + id                              = (known after apply)
      + owner_id                        = (known after apply)
      + pending_confirmation            = (known after apply)
      + protocol                        = "email"
      + raw_message_delivery            = false
      + topic_arn                       = "arn:aws:sns:us-east-1:836049003243:mulla-website-prod-email"
    }

  # module.website.aws_s3_object.images["banner.webp"] will be destroyed
  # (because key ["banner.webp"] is not in for_each map)
  - resource "aws_s3_object" "images" {
      - arn                           = "arn:aws:s3:::mulla-website-prod/images/banner.webp" -> null
      - bucket                        = "mulla-website-prod" -> null
      - bucket_key_enabled            = false -> null
      - content_type                  = "image/webp" -> null
      - etag                          = "9e4816fcb60f84f1aa607c81e88ce544" -> null
      - force_destroy                 = false -> null
      - id                            = "images/banner.webp" -> null
      - key                           = "images/banner.webp" -> null
      - metadata                      = {} -> null
      - server_side_encryption        = "AES256" -> null
      - source                        = "../webapp/images/banner.webp" -> null
      - source_hash                   = "9e4816fcb60f84f1aa607c81e88ce544" -> null
      - storage_class                 = "STANDARD" -> null
      - tags                          = {} -> null
      - tags_all                      = {} -> null
      - version_id                    = "hphOVfSkHvIeh.D9EI3rQdjne1masGYi" -> null
        # (13 unchanged attributes hidden)
    }

  # module.website.aws_s3_object.images["certs.webp"] will be created
  + resource "aws_s3_object" "images" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "mulla-website-prod"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_crc64nvme     = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "image/webp"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "images/certs.webp"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../webapp/images/certs.webp"
      + source_hash            = "b14a82b82a2f167a81e4ec0fff6a6160"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.website.aws_s3_object.images["vic-deeca.webp"] will be created
  + resource "aws_s3_object" "images" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "mulla-website-prod"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_crc64nvme     = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "image/webp"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "images/vic-deeca.webp"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../webapp/images/vic-deeca.webp"
      + source_hash            = "ff83ea0de9cd2a4e1b8ff1305dbd7957"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.website.aws_s3_object.images["vic-gov-logo.webp"] will be created
  + resource "aws_s3_object" "images" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "mulla-website-prod"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_crc64nvme     = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "image/webp"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "images/vic-gov-logo.webp"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../webapp/images/vic-gov-logo.webp"
      + source_hash            = "aaa0b120f1a600967b9a61070be9d7d0"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.website.aws_s3_object.static_files["asset-manifest.json"] will be updated in-place
  ~ resource "aws_s3_object" "static_files" {
        id                            = "website/asset-manifest.json"
      ~ source_hash                   = "97cf79d2aa5024b9ac4d07079a8f8786" -> "3c8a51a88f3a70bb6c5d51a10e77fe58"
        tags                          = {}
      ~ version_id                    = "BabdbtaovKSpfQgWk1WqLioKpq28F_VA" -> (known after apply)
        # (25 unchanged attributes hidden)
    }

  # module.website.aws_s3_object.static_files["index.html"] will be updated in-place
  ~ resource "aws_s3_object" "static_files" {
        id                            = "website/index.html"
      ~ source_hash                   = "129e46653338c026cf1ff388c28e4644" -> "8b338c4114b8385d04943bb630e5b31d"
        tags                          = {}
      ~ version_id                    = "MxAoJrD2eCOhTEioRYUZniQwQgAKw2Db" -> (known after apply)
        # (25 unchanged attributes hidden)
    }

  # module.website.aws_s3_object.static_files["static/js/main.3be8b4c5.js"] will be destroyed
  # (because key ["static/js/main.3be8b4c5.js"] is not in for_each map)
  - resource "aws_s3_object" "static_files" {
      - arn                           = "arn:aws:s3:::mulla-website-prod/website/static/js/main.3be8b4c5.js" -> null
      - bucket                        = "mulla-website-prod" -> null
      - bucket_key_enabled            = false -> null
      - content_type                  = "application/javascript" -> null
      - etag                          = "4731fce47363d4477cd8caeace59e191" -> null
      - force_destroy                 = false -> null
      - id                            = "website/static/js/main.3be8b4c5.js" -> null
      - key                           = "website/static/js/main.3be8b4c5.js" -> null
      - metadata                      = {} -> null
      - server_side_encryption        = "AES256" -> null
      - source                        = "../webapp/build/static/js/main.3be8b4c5.js" -> null
      - source_hash                   = "4731fce47363d4477cd8caeace59e191" -> null
      - storage_class                 = "STANDARD" -> null
      - tags                          = {} -> null
      - tags_all                      = {} -> null
      - version_id                    = "GEqgBEs.PviD40I6nlwqB5wd47QcRres" -> null
        # (13 unchanged attributes hidden)
    }

  # module.website.aws_s3_object.static_files["static/js/main.3be8b4c5.js.LICENSE.txt"] will be destroyed
  # (because key ["static/js/main.3be8b4c5.js.LICENSE.txt"] is not in for_each map)
  - resource "aws_s3_object" "static_files" {
      - arn                           = "arn:aws:s3:::mulla-website-prod/website/static/js/main.3be8b4c5.js.LICENSE.txt" -> null
      - bucket                        = "mulla-website-prod" -> null
      - bucket_key_enabled            = false -> null
      - content_type                  = "text/plain; charset=utf-8" -> null
      - etag                          = "ad574122e8d86a1666a1ca6da504d7a4" -> null
      - force_destroy                 = false -> null
      - id                            = "website/static/js/main.3be8b4c5.js.LICENSE.txt" -> null
      - key                           = "website/static/js/main.3be8b4c5.js.LICENSE.txt" -> null
      - metadata                      = {} -> null
      - server_side_encryption        = "AES256" -> null
      - source                        = "../webapp/build/static/js/main.3be8b4c5.js.LICENSE.txt" -> null
      - source_hash                   = "ad574122e8d86a1666a1ca6da504d7a4" -> null
      - storage_class                 = "STANDARD" -> null
      - tags                          = {} -> null
      - tags_all                      = {} -> null
      - version_id                    = "2oOc7zutj57LFhEjtXXuLsj5WDzJQZ2d" -> null
        # (13 unchanged attributes hidden)
    }

  # module.website.aws_s3_object.static_files["static/js/main.3be8b4c5.js.map"] will be destroyed
  # (because key ["static/js/main.3be8b4c5.js.map"] is not in for_each map)
  - resource "aws_s3_object" "static_files" {
      - arn                           = "arn:aws:s3:::mulla-website-prod/website/static/js/main.3be8b4c5.js.map" -> null
      - bucket                        = "mulla-website-prod" -> null
      - bucket_key_enabled            = false -> null
      - content_type                  = "application/octet-stream" -> null
      - etag                          = "91dd7cbc7f47a8c21c489e22568ffadd" -> null
      - force_destroy                 = false -> null
      - id                            = "website/static/js/main.3be8b4c5.js.map" -> null
      - key                           = "website/static/js/main.3be8b4c5.js.map" -> null
      - metadata                      = {} -> null
      - server_side_encryption        = "AES256" -> null
      - source                        = "../webapp/build/static/js/main.3be8b4c5.js.map" -> null
      - source_hash                   = "91dd7cbc7f47a8c21c489e22568ffadd" -> null
      - storage_class                 = "STANDARD" -> null
      - tags                          = {} -> null
      - tags_all                      = {} -> null
      - version_id                    = "TsRxJTT2w5wfVYzdN_9bsmN62K78PZOw" -> null
        # (13 unchanged attributes hidden)
    }

  # module.website.aws_s3_object.static_files["static/js/main.fd8e6fa2.js"] will be created
  + resource "aws_s3_object" "static_files" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "mulla-website-prod"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_crc64nvme     = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "application/javascript"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "website/static/js/main.fd8e6fa2.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../webapp/build/static/js/main.fd8e6fa2.js"
      + source_hash            = "e912055bd5c4881ccc6dbe83da63b9e6"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.website.aws_s3_object.static_files["static/js/main.fd8e6fa2.js.LICENSE.txt"] will be created
  + resource "aws_s3_object" "static_files" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "mulla-website-prod"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_crc64nvme     = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "text/plain; charset=utf-8"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "website/static/js/main.fd8e6fa2.js.LICENSE.txt"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../webapp/build/static/js/main.fd8e6fa2.js.LICENSE.txt"
      + source_hash            = "ad574122e8d86a1666a1ca6da504d7a4"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.website.aws_s3_object.static_files["static/js/main.fd8e6fa2.js.map"] will be created
  + resource "aws_s3_object" "static_files" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "mulla-website-prod"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_crc64nvme     = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "application/octet-stream"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "website/static/js/main.fd8e6fa2.js.map"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "../webapp/build/static/js/main.fd8e6fa2.js.map"
      + source_hash            = "5720f796d9b710724bec29bdd08e76ba"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

Plan: 7 to add, 2 to change, 4 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @tarekmulla, Action: `pull_request`, Workflow: `Terraform Plan`*